Terraform plan for __ibo__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_pubsub_topic_iam_binding.binding will be created
  + resource "google_pubsub_topic_iam_binding" "binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:service-435415796196@gs-project-accounts.iam.gserviceaccount.com",
        ]
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = "layout-master-change"
    }

  # google_storage_bucket.layout_file_bucket will be created
  + resource "google_storage_bucket" "layout_file_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "layout-master-prod"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_notification.notification will be created
  + resource "google_storage_notification" "notification" {
      + bucket          = "layout-master-prod"
      + event_types     = [
          + "OBJECT_FINALIZE",
          + "OBJECT_METADATA_UPDATE",
        ]
      + id              = (known after apply)
      + notification_id = (known after apply)
      + payload_format  = "JSON_API_V1"
      + self_link       = (known after apply)
      + topic           = "projects/ibo-prod/topics/layout-master-change"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #488](https://github.com/ebomart/commerce-infrastructure/actions/runs/1979600522)